app/views/users/show.html.erb

SELECT "user_friendships".* FROM "user_friendships" WHERE "user_friendships"."user_id" = $1  [["user_id", 91]]
SELECT "users".* FROM "users" INNER JOIN "user_friendships" ON "users"."id" = "user_friendships"."user_id" WHERE "user_friendships"."friend_id" = $1  [["friend_id", 91]]
---
                <ul>
                <% @user.user_friendships.each do |f| %>