app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("name", "email", "age", "location", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "tim"], ["email", "tim@tim.com"], ["age", 43], ["location", "los angeles, california"], ["created_at", "2015-03-08 07:34:48.333307"], ["updated_at", "2015-03-08 07:34:48.333307"]]

  def update
    @user = User.find(params[:id])
    if @user.update_attributes(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 49]]
UPDATE "users" SET "avatar_file_name" = $1, "avatar_file_size" = $2, "avatar_updated_at" = $3, "updated_at" = $4 WHERE "users"."id" = $5  [["avatar_file_name", "jesseSU.jpg"], ["avatar_file_size", 79332], ["avatar_updated_at", "2015-03-09 10:04:20.480162"], ["updated_at", "2015-03-09 10:04:20.650440"], ["id", 97]]